import { INewsRepository } from './INewsRepository';

export class NewsRepository implements INewsRepository {
    public static $inject: Array<string> = [
        '$http',
        '$q',
        '$timeout'
    ];

    private _news: any[] = [
        {
            id: '12355453',
            title: 'Будут ли работать карточки в день деноминации и как округлят курсы валют? Прямая линия с Нацбанком',
            categories: ['финансы'],
            //tags: ['tag1', 'tag2', 'tag3'],
            text: 'С 1 июля в кошельках белорусов появятся новые деньги: на купюрах обрежут четыре нуля, кроме того, в оборот введут копейки. И хоть денежная реформа в нашей стране проходит не в первый раз, вопросов о деноминации очень много. FINANCE.TUT.BY продолжает публиковать ответы специалистов Нацбанка на вопросы наших читателей. \pЗачем вводят одну копейку и что будет с депозитами после деноминации? Прямая линия с Нацбанком.Как будут писать курсы валют в обменниках после 1 июля?\pВопрос: С какой точностью после деноминации (сколько цифр после десятичной точки) будут рассчитываться курсы основных валют (USD, EUR, RUB)? Спасибо.\pОтвет: С 1 июля 2016 года значения официальных курсов белорусского рубля (BYN) по отношению к иностранным валютам будут устанавливаться с точностью до четырех знаков после запятой без ограничения количества знаков в целой части. Например, сегодняшний курс 19 180 рублей за доллар, выглядел бы как 1,9180 рубля за доллар (1 рубль 92 копейки).При этом в целях обеспечения репрезентативности для каждой из иностранных валют, к которой устанавливается официальный курс белорусского рубля, будет осуществлен расчет количества единиц иностранной валюты, за которое будет устанавливаться официальный курс после проведения деноминации. Данное количество единиц иностранной валюты в последующем может изменяться при значительном изменении курсов иностранных валют.Вопрос от Александра: Как будут писать курсы в обменниках? Тоже будет старый и новый? И как будет округляться официальный курс Нацбанка, по каким правилам?Ответ: В рамках исполнения указа президента от 4 ноября 2015 г. № 450 «О проведении деноминации официальной денежной единицы Республики Беларусь» банки с 1 июля по 31 декабря 2016 г. будут указывать курсы валют в денежных знаках образца 2000 года (старые деньги. — Ред.) и образца 2009 года (новые деньги. — Ред.) на сайтах банков в интернете, на стенде обменного пункта (кассы). Стенд должен находиться в доступном для обозрения физических лиц месте.При этом на специальном электронном табло банки указывают курсы валют только в денежных знаках образца 2009 года.Вопрос от Катерины: Раз в обменниках все равно появятся наши монеты, может, у нас можно будет наконец в любом обменнике сдать центы, кроны и прочую мелочь из-за границы?Ответ: Каждый банк в соответствии с локальным нормативным правовым актом самостоятельно определяет необходимость работы с иностранной валютой в виде монет при осуществлении валютно-обменных операций. Это предусмотрено пунктом 4 Инструкции о порядке осуществления валютно-обменных операций с участием физических лиц и организации работы обменных пунктов, касс при проведении таких операций, утвержденной постановлением правления Национального банка от 01.02.2014 № 35.Выдаст ли банкомат самую крупную новую купюру — 500 рублей?Вопрос от Николая Кохно: Какие купюры будут выдавать банкоматы после 1 июля?Ответ: До 1 октября 2016 года банки самостоятельно принимают решение об организации выдачи в банкоматах денежных знаков образца 2000 года или денежных знаков образца 2009 года.С учетом требований принятых нормативных правовых актов, регулирующих вопросы проведения деноминации официальной денежной единицы Республики Беларусь, с 1 октября 2016 года банки будут выдавать в банкоматах только денежные знаки образца 2009 года. Таким образом, с 1 октября 2016 г. клиенты смогут получить в банкоматах только денежные знаки образца 2009 года.При этом банки будут информировать клиентов о том, с какими денежными знаками клиент сможет совершать операции в том или ином объекте программно-технической инфраструктуры. Информирование должно быть организовано банком непосредственно в точке оказания услуги до момента её оказания.Чтобы легче было пересчитывать старые деньги в новые, мы сделали для вас удобный деноминатор!Вопрос от Олега Качана: Как будут вводить самый крупный номинал в 500 рублей,появится ли он сразу в банкоматах или его будут пускать в оборот непосредственно в кассах банков по мере необходимости? Ведь не секрет, что с крупным номиналом легче ходить за крупными покупками, например за машиной, а также собирать их дома (чтобы меньше было соблазна их потратить на мелочи)?Ответ: Национальный банк рекомендует банкам для загрузки банкоматов использовать банкноты номиналом 5, 10, 20, 50 и 100 рублей образца 2009 года с обязательной загрузкой указанных устройств банкнотами номиналом 5 рублей.Банкнотами номиналом 500 рублей образца 2009 года банкоматы загружать не будут. Банкноты указанного номинала при необходимости можно будет получить в банках по предварительном запросу.«Если я не хочу пользоваться копейками, поменяют ли мне их на бумажные деньги?»Вопрос: Будут ли инфокиоски принимать монеты? Планируется ли установка устройств для размена купюр на монеты или нужно будет бежать и самому менять где-то, если, например, на талон не хватит? И обратный вопрос: если я не хочу пользоваться монетами, могут ли мне кассиры в магазине, банке обменять их на бумажные купюры?Ответ: Решение о замене либо дооборудовании устройств по приему наличных денег банки принимают самостоятельно, исходя из технических возможностей и экономической целесообразности.Обмен монет на банкноты не предусматривается как отдельная банковская операция. На практике и сейчас кассир предприятия торговли и сервиса может производить обмен банкнот крупного номинала на более мелкие и наоборот. В то же время его обязанностью это не является, и он вправе отказать в обмене, так как денежные знаки, являющиеся законным платежным средством, обязательны к приему во все виды платежей, независимо от их номинала.Будут ли работать карточки в день деноминации?Вопрос от Михаила Прошина: Почему банкам разрешили не работать в день деноминации? Это значит, что 1 июля нельзя будет ничего оплатить, не будут работать обменные пункты? Можно ли будет рассчитаться по карточке в магазине? Будет ли работать ЕРИП? Не парализует ли это жизнь страны, с учетом того, что деноминация выпадает на будний день? Может, объявить этот день выходным?Oтвет: С учетом требований принятых нормативных правовых актов, регулирующих вопросы проведения деноминации официальной денежной единицы Республики Беларусь, 1 июля 2016 года автоматизированная система межбанковских расчетов Национального банка Республики Беларусь функционировать не будет. Это обусловлено необходимостью планомерного и рационального распределения временных, трудовых и технических ресурсов в рамках реализации работ по обновлению программного обеспечения, проведению пересчета остатков ежедневных балансов, в том числе путем пересчета остатков на счетах клиентов, а также осуществлению ряда других мероприятий, связанных с изменением нарицательной стоимости официальной денежной единицы Республики Беларусь. Таким образом, 1 июля 2016 года не будут проводиться только расчеты между банками.Порядок совершения операций между банками и клиентами 1 июля 2016 года будет определяться банком самостоятельно.Расчеты клиентов с использованием банковских платежных карточек и платежи клиентов в системе АИС «Расчет» ЕРИП 1 июля будут осуществляться в обычном режиме. Операции будут проводиться в деноминированных суммах.Вопрос: Какие деньги будут «на карточке» с 1 июля (если 31 июня на остатке был 1 миллион, то сколько окажется 1 июля?). Какая сумма будет списываться при расчете карточкой?Ответ: В конце дня 30 июня 2016 года банки произведут пересчет остатков, в том числе по счетам клиентов, к которым выданы банковские платежные карточки, в соотношении 10 000 к 1. Это предусмотрено инструкцией о порядке пересчета остатков ежедневных балансов Нацбанка, банков и небанковских кредитно-финансовых организаций Республики Беларусь в связи с деноминацией официальной денежной единицы Республики Беларусь.Соответственно, если 30 июня 2016 года остаток по счету, открытому в банке, составлял 1 000 000 белорусских рублей (цифровой код белорусского рубля «974»), то после пересчета 1 июля 2016 г. остаток составит 100 белорусских рублей (цифровой код белорусского рубля «933»).С 1 июля остаток по счету клиента в белорусских рублях, к которому выдана банковская платежная карточка, будет выражен в деноминированной сумме. Операции, проведенные клиентом с использованием банковской платежной карточки до 1 июля 2016 года и после этой даты, будут отражаться по указанномусчетувденоминированных суммах.'
        },
        {
            id: '1577954955',
            title: 'test title 2222',
            categories: ['Society'],
            //tags: ['tag4', 'tag5', 'tag6'],
            text: 'LOLOLOLOLO djfvblkvlskv fwsnvlsjnvlafhl',
        },
        {
            id: '1548995464632',
            title: 'test title 33333',
            categories: ['IT'],
            //tags: ['tag4', 'tag5', 'tag6'],
            text: 'sgishgsfjoiewtj woiewjgwieut weowehgdjp wwewegdsfhjrigjeroij erirhogjrohg owgoerrhgowigow wjogiwhogwogjwohgwogo sgishgsfjoiewtj woiewjgwieut weowehgdjp wwewegdsfhjrigjeroij erirhogjrohg owgoerrhgowigow wjogiwhogwogjwohgwogo sgishgsfjoiewtj woiewjgwieut weowehgdjp wwewegdsfhjrigjeroij erirhogjrohg owgoerrhgowigow wjogiwhogwogjwohgwogo sgishgsfjoiewtj woiewjgwieut weowehgdjp wwewegdsfhjrigjeroij erirhogjrohg owgoerrhgowigow wjogiwhogwogjwohgwogo',
        },
        {
            id: '12355453',
            title: 'test title',
            categories: ['Politics'],
            //tags: ['tag1', 'tag2', 'tag3'],
            text: 'qweq weuiqwh  qwehiqheiqhu ehq uieiq uihiq uwehq ieiq heiq ieuiqwh',
        },
        {
            id: '1577954955',
            title: 'test title 2222',
            categories: ['Society'],
            //tags: ['tag4', 'tag5', 'tag6'],
            text: 'LOLOLOLOLO djfvblkvlskv fwsnvlsjnvlafhl',
        },
        {
            id: '1548995464632',
            title: 'test title 33333',
            categories: ['IT'],
           // tags: ['tag4', 'tag5', 'tag6'],
            text: 'sgishgsfjoiewtj woiewjgwieut weowehgdjp wwewegdsfhjrigjeroij erirhogjrohg owgoerrhgowigow wjogiwhogwogjwohgwogo sgishgsfjoiewtj woiewjgwieut weowehgdjp wwewegdsfhjrigjeroij erirhogjrohg owgoerrhgowigow wjogiwhogwogjwohgwogo sgishgsfjoiewtj woiewjgwieut weowehgdjp wwewegdsfhjrigjeroij erirhogjrohg owgoerrhgowigow wjogiwhogwogjwohgwogo sgishgsfjoiewtj woiewjgwieut weowehgdjp wwewegdsfhjrigjeroij erirhogjrohg owgoerrhgowigow wjogiwhogwogjwohgwogo',
        }
    ];

    private _categories: string[] = ["Politics", "Society", "World", "Economics", "Sport", "IT"];

    constructor(
        private _$http: ng.IHttpService,
        private _$q: ng.IQService,
        private _$timeout: ng.ITimeoutService
    ) {
    }

    public getNews(): ng.IPromise<any[]> {
        let deffer = this._$q.defer();

        this._$timeout(() => {
            deffer.resolve(this._news);
        });

        return deffer.promise;
    }

    public getTags(): ng.IPromise<string[]> {
        let deffer = this._$q.defer();

        this._$timeout(() => {
            deffer.resolve(this._categories);
        });

        return deffer.promise;
    }
}